---
type: RebarHandlePositionData
namespace: Autodesk.Revit.DB.Structure
version: 2024
members: 6
tags: [revit-api, class]
---

# RebarHandlePositionData

`Autodesk.Revit.DB.Structure.RebarHandlePositionData` · Revit 2024 · 6 members

| Kind | Member | Since | Signature |
| --- | --- | --- | --- |
| Method | Dispose | — | `public void Dispose ()` |
| Method | GetBarGeometry | 2018 | `public IList < Curve > GetBarGeometry ( int barIndex )` |
| Method | GetDistributionPath | 2018.1 | `public IList < Curve > GetDistributionPath ()` |
| Method | GetNumberOfBars | 2018 | `public int GetNumberOfBars ()` |
| Method | SetPosition | 2018 | `public void SetPosition ( int handleTag , XYZ position )` |
| Property | IsValidObject | 2014 | `public bool IsValidObject { get ; }` |